In [1]:
import numpy as np

In [2]:
import pandas as pd

In [4]:
In [3]: s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [7]:
In [4]: s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [ ]:
# date_range()

In [9]:
In [5]: dates = pd.date_range("20130101", periods=6)

In [14]:
In [6]: dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
In [7]: df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [17]:
In [8]: df

                   A         B         C         D
2013-01-01 -2.197240  0.129113 -0.988095  1.192026
2013-01-02 -0.038755 -1.283670 -1.999282  0.384007
2013-01-03  0.519579 -0.249360 -0.407249  0.431796
2013-01-04  0.974347 -0.528718  0.845390 -1.507097
2013-01-05 -0.961716 -0.135289  0.420836  1.773432
2013-01-06  1.163448  0.609951 -0.697692  1.838430

In [ ]:
# df 키가 열 레이블, 값이 열 값

In [20]:
In [9]: df2 = pd.DataFrame(
            {
                "A": 1.0,
                "B": pd.Timestamp("20130102"),
                "C": pd.Series(1, index=list(range(4)), dtype="float32"),
                "D": np.array([3] *4, dtype="int32"),
                "E": pd.Categorical(["test", "train", "test", "train"]),
                "F": "foo",
            }
)

In [21]:
In [10]: df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [ ]:
# 서로 다른 dtype

In [22]:
In [11]: df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [ ]:
# tab 자동완성

In [ ]:
In [12]: df2.<TAB>  # noqa: E225, E999
df2.A                
df2.abs                      
df2.add
df2.add_prefix
df2.add_suffix
df2.align
df2.all
df2.any
df2.apply
df2.applymap
df2.B
df2.bool
df2.boxplot
df2.C
df2.clip
df2.columns
df2.copy
df2.count
df2.combine
df2.D
df2.describe
df2.diff
df2.duplicated

In [ ]:
# 프레임 위쪽 아래쪽 행 확인

In [27]:
In [13]: df.head()

                   A         B         C         D
2013-01-01 -2.197240  0.129113 -0.988095  1.192026
2013-01-02 -0.038755 -1.283670 -1.999282  0.384007
2013-01-03  0.519579 -0.249360 -0.407249  0.431796
2013-01-04  0.974347 -0.528718  0.845390 -1.507097
2013-01-05 -0.961716 -0.135289  0.420836  1.773432

In [28]:
In [14]: df.tail(3)

                   A         B         C         D
2013-01-04  0.974347 -0.528718  0.845390 -1.507097
2013-01-05 -0.961716 -0.135289  0.420836  1.773432
2013-01-06  1.163448  0.609951 -0.697692  1.838430

In [ ]:
# df.index / df.columns

In [30]:
In [15]: df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [31]:
In [16]: df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [ ]:
# df.tp_numpy() : index나 열 레이블 없는 기본 데이터의 numpy 표현

In [32]:
In [17]: df.to_numpy()

array([[-2.19724043,  0.12911283, -0.98809457,  1.19202552],
       [-0.03875525, -1.28367029, -1.99928229,  0.38400651],
       [ 0.51957884, -0.24935982, -0.40724896,  0.43179567],
       [ 0.97434665, -0.52871796,  0.84538959, -1.50709701],
       [-0.96171559, -0.13528923,  0.42083581,  1.77343192],
       [ 1.16344847,  0.60995111, -0.6976919 ,  1.83843043]])

In [ ]:
# Numpy 배열은 배열 전체에 하나의 dtype, Pandas df는 열당 하나의 dtype
df.numpy  호출하면 pandas는 df의 모든 dtype을 보유할 수 있는 NumPy dtype을 찾음
공통 데이터 유형이면 데이터를 복사해야 함.

In [34]:
In [18]: df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [35]:
In [19]: df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [ ]:
# df.describe() : 간단한 통계 요약

In [36]:
In [20]: df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.090056 -0.242996 -0.471015  0.685432
std    1.286742  0.639103  1.018503  1.243556
min   -2.197240 -1.283670 -1.999282 -1.507097
25%   -0.730976 -0.458878 -0.915494  0.395954
50%    0.240412 -0.192325 -0.552470  0.811911
75%    0.860655  0.063012  0.213815  1.628080
max    1.163448  0.609951  0.845390  1.838430

In [ ]:
# df.T : 데이터 transposing

In [37]:
In [21]: df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -2.197240   -0.038755    0.519579    0.974347   -0.961716    1.163448
B    0.129113   -1.283670   -0.249360   -0.528718   -0.135289    0.609951
C   -0.988095   -1.999282   -0.407249    0.845390    0.420836   -0.697692
D    1.192026    0.384007    0.431796   -1.507097    1.773432    1.838430

In [ ]:
# df.sort_index() : 축에 따라 정렬
axis : 값 0은 행을 식별, 1은 열을 식별

In [38]:
In [22]: df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.192026 -0.988095  0.129113 -2.197240
2013-01-02  0.384007 -1.999282 -1.283670 -0.038755
2013-01-03  0.431796 -0.407249 -0.249360  0.519579
2013-01-04 -1.507097  0.845390 -0.528718  0.974347
2013-01-05  1.773432  0.420836 -0.135289 -0.961716
2013-01-06  1.838430 -0.697692  0.609951  1.163448

In [ ]:
# df.sort_values() : 값에 따라 정렬

In [39]:
In [23]: df.sort_values(by="B")

                   A         B         C         D
2013-01-02 -0.038755 -1.283670 -1.999282  0.384007
2013-01-04  0.974347 -0.528718  0.845390 -1.507097
2013-01-03  0.519579 -0.249360 -0.407249  0.431796
2013-01-05 -0.961716 -0.135289  0.420836  1.773432
2013-01-01 -2.197240  0.129113 -0.988095  1.192026
2013-01-06  1.163448  0.609951 -0.697692  1.838430

In [ ]:
# 단일 레이블을 통과하면 열이 선택, df에 해당하는 시리즈가 생성

In [40]:
In [24]: df["A"]

2013-01-01   -2.197240
2013-01-02   -0.038755
2013-01-03    0.519579
2013-01-04    0.974347
2013-01-05   -0.961716
2013-01-06    1.163448
Freq: D, Name: A, dtype: float64

In [41]:
In [25]: df[0:3]

                   A         B         C         D
2013-01-01 -2.197240  0.129113 -0.988095  1.192026
2013-01-02 -0.038755 -1.283670 -1.999282  0.384007
2013-01-03  0.519579 -0.249360 -0.407249  0.431796

In [43]:
In [26]: df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.038755 -1.283670 -1.999282  0.384007
2013-01-03  0.519579 -0.249360 -0.407249  0.431796
2013-01-04  0.974347 -0.528718  0.845390 -1.507097

In [ ]:
# 라벨과 일치하는 행 선택

In [44]:
In [27]: df.loc[dates[0]]

A   -2.197240
B    0.129113
C   -0.988095
D    1.192026
Name: 2013-01-01 00:00:00, dtype: float64

In [ ]:
# 선택된 열 레이블이 있는 모든 행 선택

In [45]:
In [28]: df.loc[:, ["A","B"]]

                   A         B
2013-01-01 -2.197240  0.129113
2013-01-02 -0.038755 -1.283670
2013-01-03  0.519579 -0.249360
2013-01-04  0.974347 -0.528718
2013-01-05 -0.961716 -0.135289
2013-01-06  1.163448  0.609951

In [46]:
In [29]: df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.038755 -1.283670
2013-01-03  0.519579 -0.249360
2013-01-04  0.974347 -0.528718

In [ ]:
# 단일 행과 열 레이블 선책하면 스칼라 반환

In [47]:
In [30]: df.loc[dates[0], "A"]

np.float64(-2.197240433020668)

In [ ]:
# 스칼라에 빠르게 접근

In [48]:
In [31]: df.at[dates[0], "A"]

np.float64(-2.197240433020668)

In [ ]:
# DataFrame.iloc[row_index, column_index]

In [49]:
In [32]: df.iloc[3]

A    0.974347
B   -0.528718
C    0.845390
D   -1.507097
Name: 2013-01-04 00:00:00, dtype: float64

In [50]:
In [33]: df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.974347 -0.528718
2013-01-05 -0.961716 -0.135289

In [51]:
In [34]: df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.038755 -1.999282
2013-01-03  0.519579 -0.407249
2013-01-05 -0.961716  0.420836

In [52]:
In [35]: df.iloc[1:3, :]

                   A        B         C         D
2013-01-02 -0.038755 -1.28367 -1.999282  0.384007
2013-01-03  0.519579 -0.24936 -0.407249  0.431796

In [53]:
In [36]: df.iloc[:, 1:3]

                   B         C
2013-01-01  0.129113 -0.988095
2013-01-02 -1.283670 -1.999282
2013-01-03 -0.249360 -0.407249
2013-01-04 -0.528718  0.845390
2013-01-05 -0.135289  0.420836
2013-01-06  0.609951 -0.697692

In [54]:
In [37]: df.iloc[1, 1]

np.float64(-1.2836702905590316)

In [ ]:
# 스칼라에 빠르게 접근

In [55]:
In [38]: df.iat[1, 1]

np.float64(-1.2836702905590316)

In [56]:
In [39]: df[df["A"] > 0]

                   A         B         C         D
2013-01-03  0.519579 -0.249360 -0.407249  0.431796
2013-01-04  0.974347 -0.528718  0.845390 -1.507097
2013-01-06  1.163448  0.609951 -0.697692  1.838430

In [58]:
In [40]: df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.129113       NaN  1.192026
2013-01-02       NaN       NaN       NaN  0.384007
2013-01-03  0.519579       NaN       NaN  0.431796
2013-01-04  0.974347       NaN  0.845390       NaN
2013-01-05       NaN       NaN  0.420836  1.773432
2013-01-06  1.163448  0.609951       NaN  1.838430

In [ ]:
# isin() 필터링 방법 사용

In [59]:
In [41]: df2 = df.copy()

In [60]:
In [42]: df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [61]:
In [43]: df2

                   A         B         C         D      E
2013-01-01 -2.197240  0.129113 -0.988095  1.192026    one
2013-01-02 -0.038755 -1.283670 -1.999282  0.384007    one
2013-01-03  0.519579 -0.249360 -0.407249  0.431796    two
2013-01-04  0.974347 -0.528718  0.845390 -1.507097  three
2013-01-05 -0.961716 -0.135289  0.420836  1.773432   four
2013-01-06  1.163448  0.609951 -0.697692  1.838430  three

In [63]:
In [44]: df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.519579 -0.249360 -0.407249  0.431796   two
2013-01-05 -0.961716 -0.135289  0.420836  1.773432  four

In [67]:
In [45]: s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [68]:
In [46]: s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [69]:
In [47]: df["F"] = s1

In [70]:
In [48]: df.at[dates[0], "A"] = 0

In [71]:
In [49]: df.iat[0, 1] = 0

In [73]:
In [50]: df.loc[:, "D"] = np.array([5] * len(df))

In [74]:
In [51]: df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.988095  5.0  NaN
2013-01-02 -0.038755 -1.283670 -1.999282  5.0  1.0
2013-01-03  0.519579 -0.249360 -0.407249  5.0  2.0
2013-01-04  0.974347 -0.528718  0.845390  5.0  3.0
2013-01-05 -0.961716 -0.135289  0.420836  5.0  4.0
2013-01-06  1.163448  0.609951 -0.697692  5.0  5.0

In [75]:
In [52]: df2 = df.copy()

In [76]:
In [53]: df2[df2 > 0] = -df2

In [77]:
In [54]: df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.988095 -5.0  NaN
2013-01-02 -0.038755 -1.283670 -1.999282 -5.0 -1.0
2013-01-03 -0.519579 -0.249360 -0.407249 -5.0 -2.0
2013-01-04 -0.974347 -0.528718 -0.845390 -5.0 -3.0
2013-01-05 -0.961716 -0.135289 -0.420836 -5.0 -4.0
2013-01-06 -1.163448 -0.609951 -0.697692 -5.0 -5.0